package types

//	string
var str string = "222"

// int 一般用 int64或者纯int
var i8 int8 = 127 // 范围 -128 ~ 127

var i16 int16 = 95 // 范围 -32768～32767

var i32 int32 = 1200 // 范围 -2147483648～2147483647

var i64 int64 = 3200 // 范围 -9223372036854775808～9223372036854775807

// unit 无符号整形
var u8 uint8 = 222 // 8 位范围：0～255

var u16 uint16 = 333 //16 位范围：0～65535

var u32 uint32 = 444 // 32 位范围：0～4294967295

var u64 uint64 = 666 // 64 位范围：0～18446744073709551615

// flaot 浮点型小数
var f32 float32 = 1.2222

var f64 float64 = 1.5555555555555555555555555
